wookey-sdk/driver-stm32f4xx-usbotghs/usbotghs_regs.h
#ifndef STM32F4XX_USBOTG_HS_REGS_H
# define STM32F4XX_USBOTG_HS_REGS_H

# include "libc/regutils.h"
# include "libc/types.h"

#include "generated/usb_otg_hs.h"

#define USBOTG_HS_DIEPCTL0_MPSIZ_64BYTES      0
#define USBOTG_HS_DIEPCTL0_MPSIZ_32BYTES      1
#define USBOTG_HS_DIEPCTL0_MPSIZ_16BYTES      2
#define USBOTG_HS_DIEPCTL0_MPSIZ_8BYTES       3
#define USBOTG_HS_DIEPCTL_EPTYP_CONTROL       0
#define USBOTG_HS_DIEPCTL_EPTYP_ISOCHRO       1
#define USBOTG_HS_DIEPCTL_EPTYP_BULK          2
#define USBOTG_HS_DIEPCTL_EPTYP_INT           3
#define USBOTG_HS_DOEPCTL_EPTYP_CONTROL       0
#define USBOTG_HS_DOEPCTL_EPTYP_ISOCHRO       1
#define USBOTG_HS_DOEPCTL_EPTYP_BULK          2
#define USBOTG_HS_DOEPCTL_EPTYP_INT           3


/* Only registers needed for device mode are defined */
# define r_CORTEX_M_USBOTG_HS_GOTGCTL        REG_ADDR(USB_OTG_HS_BASE + 0x000)
# define r_CORTEX_M_USBOTG_HS_GOTGINT        REG_ADDR(USB_OTG_HS_BASE + 0x004)
# define r_CORTEX_M_USBOTG_HS_GAHBCFG        REG_ADDR(USB_OTG_HS_BASE + 0x008)
# define r_CORTEX_M_USBOTG_HS_GUSBCFG        REG_ADDR(USB_OTG_HS_BASE + 0x00C)
# define r_CORTEX_M_USBOTG_HS_GRSTCTL        REG_ADDR(USB_OTG_HS_BASE + 0x010)
# define r_CORTEX_M_USBOTG_HS_GINTSTS        REG_ADDR(USB_OTG_HS_BASE + 0x014)
# define r_CORTEX_M_USBOTG_HS_GINTMSK        REG_ADDR(USB_OTG_HS_BASE + 0x018)
# define r_CORTEX_M_USBOTG_HS_GRXSTSR        REG_ADDR(USB_OTG_HS_BASE + 0x01c)
# define r_CORTEX_M_USBOTG_HS_GRXSTSP        REG_ADDR(USB_OTG_HS_BASE + 0x020)
# define r_CORTEX_M_USBOTG_HS_GRXFSIZ        REG_ADDR(USB_OTG_HS_BASE + 0x024)
# define r_CORTEX_M_USBOTG_HS_DIEPTXF0       REG_ADDR(USB_OTG_HS_BASE + 0x028)
# define r_CORTEX_M_USBOTG_HS_GI2CCTL        REG_ADDR(USB_OTG_HS_BASE + 0x030)
# define r_CORTEX_M_USBOTG_HS_GCCFG          REG_ADDR(USB_OTG_HS_BASE + 0x038)
# define r_CORTEX_M_USBOTG_HS_CID            REG_ADDR(USB_OTG_HS_BASE + 0x03c)
# define r_CORTEX_M_USBOTG_HS_DIEPTXF(EP)    REG_ADDR(USB_OTG_HS_BASE + 0x100 + ((EP) * 0x4))
# define r_CORTEX_M_USBOTG_HS_DCFG           REG_ADDR(USB_OTG_HS_BASE + 0x800)
# define r_CORTEX_M_USBOTG_HS_DCTL           REG_ADDR(USB_OTG_HS_BASE + 0x804)
# define r_CORTEX_M_USBOTG_HS_DSTS           REG_ADDR(USB_OTG_HS_BASE + 0x808)
# define r_CORTEX_M_USBOTG_HS_DIEPMSK        REG_ADDR(USB_OTG_HS_BASE + 0x810)
# define r_CORTEX_M_USBOTG_HS_DOEPMSK        REG_ADDR(USB_OTG_HS_BASE + 0x814)
# define r_CORTEX_M_USBOTG_HS_DAINT          REG_ADDR(USB_OTG_HS_BASE + 0x818)
# define r_CORTEX_M_USBOTG_HS_DAINTMSK       REG_ADDR(USB_OTG_HS_BASE + 0x81C)
# define r_CORTEX_M_USBOTG_HS_DVBUSDIS       REG_ADDR(USB_OTG_HS_BASE + 0x828)
# define r_CORTEX_M_USBOTG_HS_DVBUSPULSE     REG_ADDR(USB_OTG_HS_BASE + 0x82c)
# define r_CORTEX_M_USBOTG_HS_DTHRCTL        REG_ADDR(USB_OTG_HS_BASE + 0x830)
# define r_CORTEX_M_USBOTG_HS_DIEPEMPMSK     REG_ADDR(USB_OTG_HS_BASE + 0x834)
# define r_CORTEX_M_USBOTG_HS_DEACHINT       REG_ADDR(USB_OTG_HS_BASE + 0x838)
# define r_CORTEX_M_USBOTG_HS_DEACHINTMSK    REG_ADDR(USB_OTG_HS_BASE + 0x83c)
# define r_CORTEX_M_USBOTG_HS_DIEPEACHMSK1   REG_ADDR(USB_OTG_HS_BASE + 0x844)
# define r_CORTEX_M_USBOTG_HS_DOEPEACHMSK1   REG_ADDR(USB_OTG_HS_BASE + 0x884)

#ifndef __FRAMAC__
# define r_CORTEX_M_USBOTG_HS_DIEPCTL(EP)    REG_ADDR(USB_OTG_HS_BASE + 0x900 + ((EP) * 0x20))
#endif

# define r_CORTEX_M_USBOTG_HS_DIEPINT(EP)    REG_ADDR(USB_OTG_HS_BASE + 0x908 + ((EP) * 0x20))
# define r_CORTEX_M_USBOTG_HS_DIEPTSIZ(EP)   REG_ADDR(USB_OTG_HS_BASE + 0x910 + ((EP) * 0x20))
# define r_CORTEX_M_USBOTG_HS_DIEPDMA(EP)    REG_ADDR(USB_OTG_HS_BASE + 0x914 + ((EP) * 0x20))
# define r_CORTEX_M_USBOTG_HS_DTXFSTS(EP)    REG_ADDR(USB_OTG_HS_BASE + 0x918 + ((EP) * 0x20))

#ifndef __FRAMAC__
# define r_CORTEX_M_USBOTG_HS_DOEPCTL(EP)    REG_ADDR(USB_OTG_HS_BASE + 0xb00 + ((EP) * 0x20))
#endif

# define r_CORTEX_M_USBOTG_HS_DOEPINT(EP)    REG_ADDR(USB_OTG_HS_BASE + 0xb08 + ((EP) * 0x20))
# define r_CORTEX_M_USBOTG_HS_DOEPTSIZ(EP)   REG_ADDR(USB_OTG_HS_BASE + 0xb10 + ((EP) * 0x20))
# define r_CORTEX_M_USBOTG_HS_DOEPDMA(EP)    REG_ADDR(USB_OTG_HS_BASE + 0xb14 + ((EP) * 0x20))
# define r_CORTEX_M_USBOTG_HS_PCGCCTL        REG_ADDR(USB_OTG_HS_BASE + 0xe00)

/* FIFO buffers */
# define USBOTG_HS_DEVICE_FIFO(EP)           REG_ADDR(USB_OTG_HS_BASE + (0x1000 * ((EP) + 1)))

/* Control and status register */
# define USBOTG_HS_GOTGCTL_SRQSCS_Pos        0
# define USBOTG_HS_GOTGCTL_SRQSCS_Msk        ((uint32_t)1 << USBOTG_HS_GOTGCTL_SRQSCS_Pos)
# define USBOTG_HS_GOTGCTL_SRQ_Pos           1
# define USBOTG_HS_GOTGCTL_SRQ_Msk           ((uint32_t)1 << USBOTG_HS_GOTGCTL_SRQ_Pos)
# define USBOTG_HS_GOTGCTL_HNGSCS_Pos        8
# define USBOTG_HS_GOTGCTL_HNGSCS_Msk        ((uint32_t)1 << USBOTG_HS_GOTGCTL_HNGSCS_Pos)
# define USBOTG_HS_GOTGCTL_HNPRQ_Pos         9
# define USBOTG_HS_GOTGCTL_HNPRQ_Msk         ((uint32_t)1 << USBOTG_HS_GOTGCTL_HNPRQ_Pos)
# define USBOTG_HS_GOTGCTL_HSHNPEN_Pos       10
# define USBOTG_HS_GOTGCTL_HSHNPEN_Msk       ((uint32_t)1 << USBOTG_HS_GOTGCTL_HSHNPEN_Pos)
# define USBOTG_HS_GOTGCTL_DHNPEN_Pos        11
# define USBOTG_HS_GOTGCTL_DHNPEN_Msk        ((uint32_t)1 << USBOTG_HS_GOTGCTL_DHNPEN_Pos)
# define USBOTG_HS_GOTGCTL_CIDSTS_Pos        16
# define USBOTG_HS_GOTGCTL_CIDSTS_Msk        ((uint32_t)1 << USBOTG_HS_GOTGCTL_CIDSTS_Pos)
# define USBOTG_HS_GOTGCTL_DBCT_Pos          17
# define USBOTG_HS_GOTGCTL_DBCT_Msk          ((uint32_t)1 << USBOTG_HS_GOTGCTL_DBCT_Pos)
# define USBOTG_HS_GOTGCTL_ASVLD_Pos         18
# define USBOTG_HS_GOTGCTL_ASVLD_Msk         ((uint32_t)1 << USBOTG_HS_GOTGCTL_ASVLD_Pos)
# define USBOTG_HS_GOTGCTL_BSVLD_Pos         19
# define USBOTG_HS_GOTGCTL_BSVLD_Msk         ((uint32_t)1 << USBOTG_HS_GOTGCTL_BSVLD_Pos)

/* Interrupt register */
# define USBOTG_HS_GOTGINT_SEDET_Pos         2
# define USBOTG_HS_GOTGINT_SEDET_Msk         ((uint32_t)1 << USBOTG_HS_GOTGINT_SEDET_Pos)
# define USBOTG_HS_GOTGINT_SRSSCHG_Pos       8
# define USBOTG_HS_GOTGINT_SRSSCHG_Msk       ((uint32_t)1 << USBOTG_HS_GOTGINT_SRSSCHG_Pos)
# define USBOTG_HS_GOTGINT_HNSSCHG_Pos       9
# define USBOTG_HS_GOTGINT_HNSSCHG_Msk       ((uint32_t)1 << USBOTG_HS_GOTGINT_HNSSCHG_Pos)
# define USBOTG_HS_GOTGINT_HNGDET_Pos        17
# define USBOTG_HS_GOTGINT_HNGDET_Msk        ((uint32_t)1 << USBOTG_HS_GOTGINT_HNGDET_Pos)
# define USBOTG_HS_GOTGINT_ADTOCHG_Pos       18
# define USBOTG_HS_GOTGINT_ADTOCHG_Msk       ((uint32_t)1 << USBOTG_HS_GOTGINT_ADTOCHG_Pos)
# define USBOTG_HS_GOTGINT_DBCDNE_Pos        19
# define USBOTG_HS_GOTGINT_DBCDNE_Msk        ((uint32_t)1 << USBOTG_HS_GOTGINT_DBCDNE_Pos)

/* AHB configuration register */
# define USBOTG_HS_GAHBCFG_GINTMSK_Pos       0
# define USBOTG_HS_GAHBCFG_GINTMSK_Msk       ((uint32_t)1 << USBOTG_HS_GAHBCFG_GINTMSK_Pos)
# define USBOTG_HS_GAHBCFG_HBSTLEN_Pos       1
# define USBOTG_HS_GAHBCFG_HBSTLEN_Msk       ((uint32_t)0xf << USBOTG_HS_GAHBCFG_HBSTLEN_Pos)
# define USBOTG_HS_GAHBCFG_HBSTLEN_SINGLE 0
# define USBOTG_HS_GAHBCFG_HBSTLEN_INCR   1
# define USBOTG_HS_GAHBCFG_HBSTLEN_INCR4  3
# define USBOTG_HS_GAHBCFG_HBSTLEN_INCR8  5
# define USBOTG_HS_GAHBCFG_HBSTLEN_INCR16 7
# define USBOTG_HS_GAHBCFG_DMAEN_Pos         5
# define USBOTG_HS_GAHBCFG_DMAEN_Msk         ((uint32_t)1 << USBOTG_HS_GAHBCFG_DMAEN_Pos)
# define USBOTG_HS_GAHBCFG_TXFELVL_Pos       7
# define USBOTG_HS_GAHBCFG_TXFELVL_Msk       ((uint32_t)1 << USBOTG_HS_GAHBCFG_TXFELVL_Pos)
# define USBOTG_HS_GAHBCFG_PTXFELVL_Pos      8
# define USBOTG_HS_GAHBCFG_PTXFELVL_Msk      ((uint32_t)1 << USBOTG_HS_GAHBCFG_PTXFELVL_Pos)

