wookey-sdk/driver-stm32f4xx-usbotghs/usbotghs_regs.h
/* USB configuration register */
# define USBOTG_HS_GUSBCFG_TOCAL_Pos         0
# define USBOTG_HS_GUSBCFG_TOCAL_Msk         ((uint32_t)0x7 << USBOTG_HS_GUSBCFG_TOCAL_Pos)
/* [RB]: the following fields are used by ST stack USB HS initialization
 * but they are NOT in the datasheet ...
 */
# define USBOTG_HS_GUSBCFG_PHYIF_Pos         3
# define USBOTG_HS_GUSBCFG_PHYIF_Msk         ((uint32_t)1 << USBOTG_HS_GUSBCFG_PHYIF_Pos)
# define USBOTG_HS_GUSBCFG_UTMISEL_Pos       4
# define USBOTG_HS_GUSBCFG_UTMISEL_Msk       ((uint32_t)1 << USBOTG_HS_GUSBCFG_UTMISEL_Pos)
# define USBOTG_HS_GUSBCFG_FSINTF_Pos        5
# define USBOTG_HS_GUSBCFG_FSINTF_Msk        ((uint32_t)1 << USBOTG_HS_GUSBCFG_FSINTF_Pos)
/****/
# define USBOTG_HS_GUSBCFG_PHYSEL_Pos        6
# define USBOTG_HS_GUSBCFG_PHYSEL_Msk        ((uint32_t)1 << USBOTG_HS_GUSBCFG_PHYSEL_Pos)
/* [RB]: the following fields are used by ST stack USB HS initialization
 * but they are NOT in the datasheet ...
 */
# define USBOTG_HS_GUSBCFG_DDRSEL_Pos        7
# define USBOTG_HS_GUSBCFG_DDRSEL_Msk        ((uint32_t)1 << USBOTG_HS_GUSBCFG_DDRSEL_Pos)
/****/
# define USBOTG_HS_GUSBCFG_SRPCAP_Pos        8
# define USBOTG_HS_GUSBCFG_SRPCAP_Msk        ((uint32_t)1 << USBOTG_HS_GUSBCFG_SRPCAP_Pos)
# define USBOTG_HS_GUSBCFG_HNPCAP_Pos        9
# define USBOTG_HS_GUSBCFG_HNPCAP_Msk        ((uint32_t)1 << USBOTG_HS_GUSBCFG_HNPCAP_Pos)
# define USBOTG_HS_GUSBCFG_TRDT_Pos          10
# define USBOTG_HS_GUSBCFG_TRDT_Msk          ((uint32_t)0xf << USBOTG_HS_GUSBCFG_TRDT_Pos)
# define USBOTG_HS_GUSBCFG_PHYLPCS_Pos       15
# define USBOTG_HS_GUSBCFG_PHYLPCS_Msk       ((uint32_t)1 << USBOTG_HS_GUSBCFG_PHYLPCS_Pos)
# define USBOTG_HS_GUSBCFG_ULPIFSLS_Pos      17
# define USBOTG_HS_GUSBCFG_ULPIFSLS_Msk      ((uint32_t)1 << USBOTG_HS_GUSBCFG_ULPIFSLS_Pos)
# define USBOTG_HS_GUSBCFG_ULPIAR_Pos        18
# define USBOTG_HS_GUSBCFG_ULPIAR_Msk        ((uint32_t)1 << USBOTG_HS_GUSBCFG_ULPIAR_Pos)
# define USBOTG_HS_GUSBCFG_ULPICSM_Pos       19
# define USBOTG_HS_GUSBCFG_ULPICSM_Msk       ((uint32_t)1 << USBOTG_HS_GUSBCFG_ULPICSM_Pos)
# define USBOTG_HS_GUSBCFG_ULPIEVBUSD_Pos    20
# define USBOTG_HS_GUSBCFG_ULPIEVBUSD_Msk    ((uint32_t)1 << USBOTG_HS_GUSBCFG_ULPIEVBUSD_Pos)
# define USBOTG_HS_GUSBCFG_ULPIVBUSI_Pos     21
# define USBOTG_HS_GUSBCFG_ULPIVBUSI_Msk     ((uint32_t)1 << USBOTG_HS_GUSBCFG_ULPIVBUSI_Pos)
# define USBOTG_HS_GUSBCFG_TSDPS_Pos         22
# define USBOTG_HS_GUSBCFG_TSDPS_Msk         ((uint32_t)1 << USBOTG_HS_GUSBCFG_TSDPS_Pos)
# define USBOTG_HS_GUSBCFG_PCCI_Pos          23
# define USBOTG_HS_GUSBCFG_PCCI_Msk          ((uint32_t)1 << USBOTG_HS_GUSBCFG_PCCI_Pos)
# define USBOTG_HS_GUSBCFG_PTCI_Pos          24
# define USBOTG_HS_GUSBCFG_PTCI_Msk          ((uint32_t)1 << USBOTG_HS_GUSBCFG_PTCI_Pos)
# define USBOTG_HS_GUSBCFG_ULPIIPD_Pos       25
# define USBOTG_HS_GUSBCFG_ULPIIPD_Msk       ((uint32_t)1 << USBOTG_HS_GUSBCFG_ULPIIPD_Pos)
# define USBOTG_HS_GUSBCFG_FHMOD_Pos         29
# define USBOTG_HS_GUSBCFG_FHMOD_Msk         ((uint32_t)1 << USBOTG_HS_GUSBCFG_FHMOD_Pos)
# define USBOTG_HS_GUSBCFG_FDMOD_Pos         30
# define USBOTG_HS_GUSBCFG_FDMOD_Msk         ((uint32_t)1 << USBOTG_HS_GUSBCFG_FDMOD_Pos)
# define USBOTG_HS_GUSBCFG_CTXPKT_Pos        31
# define USBOTG_HS_GUSBCFG_CTXPKT_Msk        ((uint32_t)1 << USBOTG_HS_GUSBCFG_CTXPKT_Pos)

/* Reset register */
# define USBOTG_HS_GRSTCTL_CSRST_Pos         0
# define USBOTG_HS_GRSTCTL_CSRST_Msk         ((uint32_t)1 << USBOTG_HS_GRSTCTL_CSRST_Pos)
# define USBOTG_HS_GRSTCTL_HSRST_Pos         1
# define USBOTG_HS_GRSTCTL_HSRST_Msk         ((uint32_t)1 << USBOTG_HS_GRSTCTL_HSRST_Pos)
# define USBOTG_HS_GRSTCTL_FCRST_Pos         2
# define USBOTG_HS_GRSTCTL_FCRST_Msk         ((uint32_t)1 << USBOTG_HS_GRSTCTL_FCRST_Pos)
# define USBOTG_HS_GRSTCTL_RXFFLSH_Pos       4
# define USBOTG_HS_GRSTCTL_RXFFLSH_Msk       ((uint32_t)1 << USBOTG_HS_GRSTCTL_RXFFLSH_Pos)
# define USBOTG_HS_GRSTCTL_TXFFLSH_Pos       5
# define USBOTG_HS_GRSTCTL_TXFFLSH_Msk       ((uint32_t)1 << USBOTG_HS_GRSTCTL_TXFFLSH_Pos)
# define USBOTG_HS_GRSTCTL_TXFNUM_Pos        6
# define USBOTG_HS_GRSTCTL_TXFNUM_Msk        ((uint32_t)0x1f << USBOTG_HS_GRSTCTL_TXFNUM_Pos)
# define USBOTG_HS_GRSTCTL_DMAREQ_Pos        30
# define USBOTG_HS_GRSTCTL_DMAREQ_Msk        ((uint32_t)1 << USBOTG_HS_GRSTCTL_DMAREQ_Pos)
# define USBOTG_HS_GRSTCTL_AHBIDL_Pos        31
# define USBOTG_HS_GRSTCTL_AHBIDL_Msk        ((uint32_t)1 << USBOTG_HS_GRSTCTL_AHBIDL_Pos)

/* Core interrupt register */
# define USBOTG_HS_GINTSTS_CMOD_Pos          0
# define USBOTG_HS_GINTSTS_CMOD_Msk          ((uint32_t)1 << USBOTG_HS_GINTSTS_CMOD_Pos)
# define USBOTG_HS_GINTSTS_MMIS_Pos          1
# define USBOTG_HS_GINTSTS_MMIS_Msk          ((uint32_t)1 << USBOTG_HS_GINTSTS_MMIS_Pos)
# define USBOTG_HS_GINTSTS_OTGINT_Pos        2
# define USBOTG_HS_GINTSTS_OTGINT_Msk        ((uint32_t)1 << USBOTG_HS_GINTSTS_OTGINT_Pos)
# define USBOTG_HS_GINTSTS_SOF_Pos           3
# define USBOTG_HS_GINTSTS_SOF_Msk           ((uint32_t)1 << USBOTG_HS_GINTSTS_SOF_Pos)
# define USBOTG_HS_GINTSTS_RXFLVL_Pos        4
# define USBOTG_HS_GINTSTS_RXFLVL_Msk        ((uint32_t)1 << USBOTG_HS_GINTSTS_RXFLVL_Pos)
# define USBOTG_HS_GINTSTS_NPTXFE_Pos        5
# define USBOTG_HS_GINTSTS_NPTXFE_Msk        ((uint32_t)1 << USBOTG_HS_GINTSTS_NPTXFE_Pos)
# define USBOTG_HS_GINTSTS_GINAKEFF_Pos      6
# define USBOTG_HS_GINTSTS_GINAKEFF_Msk      ((uint32_t)1 << USBOTG_HS_GINTSTS_GINAKEFF_Pos)
# define USBOTG_HS_GINTSTS_GOUTNAKEFF_P      7
# define USBOTG_HS_GINTSTS_GOUTNAKEFF_M      ((uint32_t)1 << USBOTG_HS_GINTSTS_GOUTNAKEFF_Pos)
# define USBOTG_HS_GINTSTS_ESUSP_Pos         10
# define USBOTG_HS_GINTSTS_ESUSP_Msk         ((uint32_t)1 << USBOTG_HS_GINTSTS_ESUSP_Pos)
# define USBOTG_HS_GINTSTS_USBSUSP_Pos       11
# define USBOTG_HS_GINTSTS_USBSUSP_Msk       ((uint32_t)1 << USBOTG_HS_GINTSTS_USBSUSP_Pos)
# define USBOTG_HS_GINTSTS_USBRST_Pos        12
# define USBOTG_HS_GINTSTS_USBRST_Msk        ((uint32_t)1 << USBOTG_HS_GINTSTS_USBRST_Pos)
# define USBOTG_HS_GINTSTS_ENUMDNE_Pos       13
# define USBOTG_HS_GINTSTS_ENUMDNE_Msk       ((uint32_t)1 << USBOTG_HS_GINTSTS_ENUMDNE_Pos)
# define USBOTG_HS_GINTSTS_ISOODRP_Pos       14
# define USBOTG_HS_GINTSTS_ISOODRP_Msk       ((uint32_t)1 << USBOTG_HS_GINTSTS_ISOODRP_Pos)
# define USBOTG_HS_GINTSTS_EOPF_Pos          15
# define USBOTG_HS_GINTSTS_EOPF_Msk          ((uint32_t)1 << USBOTG_HS_GINTSTS_EOPF_Pos)
# define USBOTG_HS_GINTSTS_EPMISM_Pos        17
# define USBOTG_HS_GINTSTS_EPMISM_Msk        ((uint32_t)1 << USB_FS_GINTSTS_EPMISM_Pos)
# define USBOTG_HS_GINTSTS_IEPINT_Pos        18
# define USBOTG_HS_GINTSTS_IEPINT_Msk        ((uint32_t)1 << USBOTG_HS_GINTSTS_IEPINT_Pos)
# define USBOTG_HS_GINTSTS_OEPINT_Pos        19
# define USBOTG_HS_GINTSTS_OEPINT_Msk        ((uint32_t)1 << USBOTG_HS_GINTSTS_OEPINT_Pos)
# define USBOTG_HS_GINTSTS_IISOIXFR_Pos      20
# define USBOTG_HS_GINTSTS_IISOIXFR_Msk      ((uint32_t)1 << USBOTG_HS_GINTSTS_IISOIXFR_Pos)
# define USBOTG_HS_GINTSTS_IPXFR_Pos         21
# define USBOTG_HS_GINTSTS_IPXFR_Msk         ((uint32_t)1 << USBOTG_HS_GINTSTS_IPXFR_Pos)
# define USBOTG_HS_GINTSTS_DATAFSUSP_Pos     22
# define USBOTG_HS_GINTSTS_DATAFSUSP_Msk     ((uint32_t)1 << USBOTG_HS_GINTSTS_DATAFSUSP_Pos)
# define USBOTG_HS_GINTSTS_HPRTINT_Pos       24
# define USBOTG_HS_GINTSTS_HPRTINT_Msk       ((uint32_t)1 << USBOTG_HS_GINTSTS_HPRTINT_Pos)
# define USBOTG_HS_GINTSTS_HCINT_Pos         25
# define USBOTG_HS_GINTSTS_HCINT_Msk         ((uint32_t)1 << USBOTG_HS_GINTSTS_HCINT_Pos)
# define USBOTG_HS_GINTSTS_PTXFE_Pos         26
# define USBOTG_HS_GINTSTS_PTXFE_Msk         ((uint32_t)1 << USBOTG_HS_GINTSTS_PTXFE_Pos)
# define USBOTG_HS_GINTSTS_CIDSCHG_Pos       28
# define USBOTG_HS_GINTSTS_CIDSCHG_Msk       ((uint32_t)1 << USBOTG_HS_GINTSTS_CIDSCHG_Pos)
# define USBOTG_HS_GINTSTS_DISCINT_Pos       29
# define USBOTG_HS_GINTSTS_DISCINT_Msk       ((uint32_t)1 << USBOTG_HS_GINTSTS_DISCINT_Pos)
# define USBOTG_HS_GINTSTS_SRQINT_Pos        30
# define USBOTG_HS_GINTSTS_SRQINT_Msk        ((uint32_t)1 << USBOTG_HS_GINTSTS_SRQINT_Pos)
# define USBOTG_HS_GINTSTS_WKUPINT_Pos       31
# define USBOTG_HS_GINTSTS_WKUPINT_Msk       ((uint32_t)1 << USBOTG_HS_GINTSTS_WKUPINT_Pos)

/* Interrupt mask register */
# define USBOTG_HS_GINTMSK_MMISM_Pos         1
# define USBOTG_HS_GINTMSK_MMISM_Msk         ((uint32_t)1 << USBOTG_HS_GINTMSK_MMISM_Pos)
# define USBOTG_HS_GINTMSK_OTGINT_Pos        2
# define USBOTG_HS_GINTMSK_OTGINT_Msk        ((uint32_t)1 << USBOTG_HS_GINTMSK_OTGINT_Pos)
# define USBOTG_HS_GINTMSK_SOFM_Pos          3
# define USBOTG_HS_GINTMSK_SOFM_Msk          ((uint32_t)1 << USBOTG_HS_GINTMSK_SOFM_Pos)
# define USBOTG_HS_GINTMSK_RXFLVLM_Pos       4
# define USBOTG_HS_GINTMSK_RXFLVLM_Msk       ((uint32_t)1 << USBOTG_HS_GINTMSK_RXFLVLM_Pos)
# define USBOTG_HS_GINTMSK_NPTXFEM_Pos       5
# define USBOTG_HS_GINTMSK_NPTXFEM_Msk       ((uint32_t)1 << USBOTG_HS_GINTMSK_NPTXFEM_Pos)
# define USBOTG_HS_GINTMSK_GINAKEFFM_Pos     6
# define USBOTG_HS_GINTMSK_GINAKEFFM_Msk     ((uint32_t)1 << USBOTG_HS_GINTMSK_GINAKEFFM_Pos)
# define USBOTG_HS_GINTMSK_GOUTNAKEFFM_Pos   7
# define USBOTG_HS_GINTMSK_GOUTNAKEFFM_Msk   ((uint32_t)1 << USBOTG_HS_GINTMSK_GOUTNAKEFFM_Pos)
# define USBOTG_HS_GINTMSK_ESUSPM_Pos        10
# define USBOTG_HS_GINTMSK_ESUSPM_Msk        ((uint32_t)1 << USBOTG_HS_GINTMSK_ESUSPM_Pos)
# define USBOTG_HS_GINTMSK_USBSUSPM_Pos      11
# define USBOTG_HS_GINTMSK_USBSUSPM_Msk      ((uint32_t)1 << USBOTG_HS_GINTMSK_USBSUSPM_Pos)
# define USBOTG_HS_GINTMSK_USBRST_Pos        12
# define USBOTG_HS_GINTMSK_USBRST_Msk        ((uint32_t)1 << USBOTG_HS_GINTMSK_USBRST_Pos)
# define USBOTG_HS_GINTMSK_ENUMDNEM_Pos      13
# define USBOTG_HS_GINTMSK_ENUMDNEM_Msk      ((uint32_t)1 << USBOTG_HS_GINTMSK_ENUMDNEM_Pos)
# define USBOTG_HS_GINTMSK_ISOODRPM_Pos      14
# define USBOTG_HS_GINTMSK_ISOODRPM_Msk      ((uint32_t)1 << USBOTG_HS_GINTMSK_ISOODRPM_Pos)
# define USBOTG_HS_GINTMSK_EOPFM_Pos         15
# define USBOTG_HS_GINTMSK_EOPFM_Msk         ((uint32_t)1 << USBOTG_HS_GINTMSK_EOPFM_Pos)
# define USBOTG_HS_GINTMSK_EPMISM_Pos        17
# define USBOTG_HS_GINTMSK_EPMISM_Msk        ((uint32_t)1 << USBOTG_HS_GINTMSK_EPMISM_Pos)
# define USBOTG_HS_GINTMSK_IEPINT_Pos        18
# define USBOTG_HS_GINTMSK_IEPINT_Msk        ((uint32_t)1 << USBOTG_HS_GINTMSK_IEPINT_Pos)
# define USBOTG_HS_GINTMSK_OEPINT_Pos        19
# define USBOTG_HS_GINTMSK_OEPINT_Msk        ((uint32_t)1 << USBOTG_HS_GINTMSK_OEPINT_Pos)
# define USBOTG_HS_GINTMSK_IISOIXFRM_Pos     20
# define USBOTG_HS_GINTMSK_IISOIXFRM_Msk     ((uint32_t)1 << USBOTG_HS_GINTMSK_IISOIXFRM_Pos)
# define USBOTG_HS_GINTMSK_IISOOXFRM_Pos     21
# define USBOTG_HS_GINTMSK_IISOOXFRM_Msk     ((uint32_t)1 << USBOTG_HS_GINTMSK_IISOOXFRM_Pos)
# define USBOTG_HS_GINTMSK_FSUSPM_Pos        22
# define USBOTG_HS_GINTMSK_FSUSPM_Msk        ((uint32_t)1 << USBOTG_HS_GINTMSK_FSUSPM_Pos)
# define USBOTG_HS_GINTMSK_PRTIM_Pos         24
# define USBOTG_HS_GINTMSK_PRTIM_Msk         ((uint32_t)1 << USBOTG_HS_GINTMSK_PRTIM_Pos)
# define USBOTG_HS_GINTMSK_HCIM_Pos          25
# define USBOTG_HS_GINTMSK_HCIM_Msk          ((uint32_t)1 << USBOTG_HS_GINTMSK_HCIM_Pos)
# define USBOTG_HS_GINTMSK_PTXFEM_Pos        26
# define USBOTG_HS_GINTMSK_PTXFEM_Msk        ((uint32_t)1 << USBOTG_HS_GINTMSK_PTXFEM_Pos)
# define USBOTG_HS_GINTMSK_CIDSCHGM_Pos      28
# define USBOTG_HS_GINTMSK_CIDSCHGM_Msk      ((uint32_t)1 << USBOTG_HS_GINTMSK_CIDSCHGM_Pos)
# define USBOTG_HS_GINTMSK_DISCINT_Pos       29
# define USBOTG_HS_GINTMSK_DISCINT_Msk       ((uint32_t)1 << USBOTG_HS_GINTMSK_DISCINT_Pos)
# define USBOTG_HS_GINTMSK_SRQIM_Pos         30
# define USBOTG_HS_GINTMSK_SRQIM_Msk         ((uint32_t)1 << USBOTG_HS_GINTMSK_SRQIM_Pos)
# define USBOTG_HS_GINTMSK_WUIM_Pos          31
# define USBOTG_HS_GINTMSK_WUIM_Msk         ((uint32_t)1 << USBOTG_HS_GINTMSK_WUIM_Pos)

/* Receive status debug read/pop registers */
# define USBOTG_HS_GRXSTSR_EPNUM_Pos         0
# define USBOTG_HS_GRXSTSR_EPNUM_Msk         ((uint32_t)0xf << USBOTG_HS_GRXSTSR_EPNUM_Pos)
# define USBOTG_HS_GRXSTSR_BCNT_Pos          4
# define USBOTG_HS_GRXSTSR_BCNT_Msk          ((uint32_t)0x7ff << USBOTG_HS_GRXSTSR_BCNT_Pos)
# define USBOTG_HS_GRXSTSR_DPID_Pos          15
# define USBOTG_HS_GRXSTSR_DPID_Msk          ((uint32_t)0x3 << USBOTG_HS_GRXSTSR_DPID_Pos)
# define USBOTG_HS_GRXSTSR_PKTSTS_Pos        17
# define USBOTG_HS_GRXSTSR_PKTSTS_Msk        ((uint32_t)0xf << USBOTG_HS_GRXSTSR_PKTSTS_Pos)
#    define USBOTG_HS_GRXSTSR_PKTSTS_GLOBAL_OUT_NAK             1
#    define USBOTG_HS_GRXSTSR_PKTSTS_OUT_DATA                   2
#    define USBOTG_HS_GRXSTSR_PKTSTS_OUT_TRANFER_COMPLETE       3
#    define USBOTG_HS_GRXSTSR_PKTSTS_SETUP_TRANSACTION_COMPLETE 4
#    define USBOTG_HS_GRXSTSR_PKTSTS_SETUP_DATA                 6
# define USBOTG_HS_GRXSTSR_FRMNUM_Pos        21
# define USBOTG_HS_GRXSTSR_FRMNUM_Msk        ((uint32_t)0x7f << USBOTG_HS_GRXSTSR_FRMNUM_Pos)

#define USBOTG_HS_GRXSTSP_GET_STATUS(grxstsp) ((grxstsp & 0x1e0000) >> 17)
#define USBOTG_HS_GRXSTSP_GET_DPID(grxstsp) ((grxstsp & 0x18000) >> 15)
#define USBOTG_HS_GRXSTSP_GET_BCNT(grxstsp) ((grxstsp & 0x7ff0) >> 4)
#define USBOTG_HS_GRXSTSP_GET_EPNUM(grxstsp) (grxstsp & 0xf)
#define USBOTG_HS_GRXSTSP_GET_CHNUM(grxstsp) (grxstsp & 0xf)



/* Receive FIFO size register */
# define USBOTG_HS_GRXFSIZ_RXFD_Pos          0
# define USBOTG_HS_GRXFSIZ_RXFD_Msk          ((uint32_t)0xffff << USBOTG_HS_GRXFSIZ_RXFD_Pos)

