wookey-sdk/driver-stm32f4xx-usbotghs/usbotghs_regs.h
/* Device endpoint interrupt register */
# define USBOTG_HS_DIEPINT_XFRC_Pos        0
# define USBOTG_HS_DIEPINT_XFRC_Msk        ((uint32_t)1 << USBOTG_HS_DIEPINT_XFRC_Pos)
# define USBOTG_HS_DIEPINT_EPDISD_Pos        1
# define USBOTG_HS_DIEPINT_EPDISD_Msk        ((uint32_t)1 << USBOTG_HS_DIEPINT_TOC_Pos)
# define USBOTG_HS_DIEPINT_TOC_Pos            3
# define USBOTG_HS_DIEPINT_TOC_Msk            ((uint32_t)1 << USBOTG_HS_DIEPINT_TOC_Pos)
# define USBOTG_HS_DIEPINT_ITTXFE_Pos        4
# define USBOTG_HS_DIEPINT_ITTXFE_Msk        ((uint32_t)1 << USBOTG_HS_DIEPINT_ITTXFE_Pos)
# define USBOTG_HS_DIEPINT_INEPNE_Pos        6
# define USBOTG_HS_DIEPINT_INEPNE_Msk        ((uint32_t)1 << USBOTG_HS_DIEPINT_INEPNE_Pos)
# define USBOTG_HS_DIEPINT_TXFE_Pos        7
# define USBOTG_HS_DIEPINT_TXFE_Msk        ((uint32_t)1 << USBOTG_HS_DIEPINT_TXFE_Pos)
# define USBOTG_HS_DIEPINT_TXFIFOUDRN_Pos        8
# define USBOTG_HS_DIEPINT_TXFIFOUDRN_Msk        ((uint32_t)1 << USBOTG_HS_DIEPINT_TXFIFOUDRN_Pos)
# define USBOTG_HS_DIEPINT_BNA_Pos            9
# define USBOTG_HS_DIEPINT_BNA_Msk            ((uint32_t)1 << USBOTG_HS_DIEPINT_BNA_Pos)
# define USBOTG_HS_DIEPINT_PKTDRPSTS_Pos        11
# define USBOTG_HS_DIEPINT_PKTDRPSTS_Msk        ((uint32_t)1 << USBOTG_HS_DIEPINT_PKTDRPSTS_Pos)
# define USBOTG_HS_DIEPINT_BERR_Pos        12
# define USBOTG_HS_DIEPINT_BERR_Msk        ((uint32_t)1 << USBOTG_HS_DIEPINT_BERR_Pos)
# define USBOTG_HS_DIEPINT_NAK_Pos            13
# define USBOTG_HS_DIEPINT_NAK_Msk            ((uint32_t)1 << USBOTG_HS_DIEPINT_NAK_Pos)

/* Device IN endpoint X transfert size register */
# define USBOTG_HS_DIEPTSIZ_XFRSIZ_Pos(EP)        0
# define USBOTG_HS_DIEPTSIZ_XFRSIZ_Msk(EP)        ((EP) > 0 ? ((uint32_t)0x7ffff << USBOTG_HS_DIEPTSIZ_XFRSIZ_Pos(EP)) \
                        : ((uint32_t)0x7f << USBOTG_HS_DIEPTSIZ_XFRSIZ_Pos(EP)))
# define USBOTG_HS_DIEPTSIZ_PKTCNT_Pos(EP)        19
# define USBOTG_HS_DIEPTSIZ_PKTCNT_Msk(EP)        ((EP) > 0 ? ((uint32_t)0x3ff << USBOTG_HS_DIEPTSIZ_PKTCNT_Pos(EP)) \
                        : ((uint32_t)0x3 << USBOTG_HS_DIEPTSIZ_PKTCNT_Pos(EP)))
# define USBOTG_HS_DIEPTSIZ_MCNT_Pos(EP)        29
# define USBOTG_HS_DIEPTSIZ_MCNT_Msk(EP)        ((EP) > 0 ? ((uint32_t)0x3 << USBOTG_HS_DIEPTSIZ_MCNT_Pos(EP)) : 0)

/* Device EPx DMA address register */
# define USBOTG_HS_DIEPDMA_DMAADDR_Pos        0
# define USBOTG_HS_DIEPDMA_DMAADDR_Msk        ((uint32_t)0xffffffff << USBOTG_HS_DIEPDMA_DMAADDR_Pos)

/* Device IN endpoint transmit FIFO status register */
# define USBOTG_HS_DTXFSTS_INEPTFSAV_Pos        0
# define USBOTG_HS_DTXFSTS_INEPTFSAV_Msk        ((uint32_t)0xffff << USBOTG_HS_DTXFSTS_INEPTFSAV_Pos)

/* Device control OUT endpoint X control register */
# define USBOTG_HS_DOEPCTL_MPSIZ_Pos(EP)        0
# define USBOTG_HS_DOEPCTL_MPSIZ_Msk(EP)        ((EP) > 0 ? ((uint32_t)0x7ff << USBOTG_HS_DOEPCTL_MPSIZ_Pos(EP)) \
                        : ((uint32_t)0x3 << USBOTG_HS_DOEPCTL_MPSIZ_Pos(EP)))
# define USBOTG_HS_DOEPCTL_USBAEP_Pos        15
# define USBOTG_HS_DOEPCTL_USBAEP_Msk        ((uint32_t)1 << USBOTG_HS_DOEPCTL_USBAEP_Pos)
# define USBOTG_HS_DOEPCTL_EONUM_Pos(EP)        16
# define USBOTG_HS_DOEPCTL_EONUM_Msk(EP)        ((EP) > 0 ? ((uint32_t)1 << USBOTG_HS_DOEPCTL_USBAEP_Pos(EP)) : 0)
# define USBOTG_HS_DOEPCTL_NAKSTS_Pos        17
# define USBOTG_HS_DOEPCTL_NAKSTS_Msk        ((uint32_t)1 << USBOTG_HS_DOEPCTL_NAKSTS_Pos)
# define USBOTG_HS_DOEPCTL_EPTYP_Pos        18
# define USBOTG_HS_DOEPCTL_EPTYP_Msk        ((uint32_t)0x3 << USBOTG_HS_DOEPCTL_EPTYP_Pos)
#    define USBOTG_HS_DOEPCTL_EPTYP_CONTROL    0
#    define USBOTG_HS_DOEPCTL_EPTYP_ISOCHRO    1
#    define USBOTG_HS_DOEPCTL_EPTYP_BULK    2
#    define USBOTG_HS_DOEPCTL_EPTYP_INT        3
# define USBOTG_HS_DOEPCTL_SNPM_Pos        20
# define USBOTG_HS_DOEPCTL_SNPM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPCTL_SNPM_Pos)
# define USBOTG_HS_DOEPCTL_STALL_Pos        21
# define USBOTG_HS_DOEPCTL_STALL_Msk        ((uint32_t)1 << USBOTG_HS_DOEPCTL_STALL_Pos)
# define USBOTG_HS_DOEPCTL_CNAK_Pos        26
# define USBOTG_HS_DOEPCTL_CNAK_Msk        ((uint32_t)1 << USBOTG_HS_DOEPCTL_CNAK_Pos)
# define USBOTG_HS_DOEPCTL_SNAK_Pos        27
# define USBOTG_HS_DOEPCTL_SNAK_Msk        ((uint32_t)1 << USBOTG_HS_DOEPCTL_SNAK_Pos)
# define USBOTG_HS_DOEPCTL_SD0PID_Pos           28
# define USBOTG_HS_DOEPCTL_SD0PID_Msk           ((uint32_t)1 << USBOTG_HS_DOEPCTL_SD0PID_Pos)
# define USBOTG_HS_DOEPCTL_SD1PID_Pos           29
# define USBOTG_HS_DOEPCTL_SD1PID_Msk           ((uint32_t)1 << USBOTG_HS_DOEPCTL_SD1PID_Pos)
#if 0
# define USBOTG_HS_DOEPCTL_SD0PID_Pos(EP)        28 /* Applies to interrupt/bulk OUT EP */
# define USBOTG_HS_DOEPCTL_SD0PID_Msk(EP)        ((EP) > 0 ? ((uint32_t)1 << USBOTG_HS_DOEPCTL_SD0PID_Pos(EP)) : 0)
# define USBOTG_HS_DOEPCTL_SEVNFRM_Pos(EP)        28 /* Applies to isochronous OUT EP */
# define USBOTG_HS_DOEPCTL_SEVNFRM_Msk(EP)        ((EP) > 0 ? ((uint32_t)1 << USBOTG_HS_DOEPCTL_SEVNFRM_Pos(EP)) : 0)
# define USBOTG_HS_DOEPCTL_SD1PID_Pos(EP)        29 /* Applies to interrupt/bulk OUT EP */
# define USBOTG_HS_DOEPCTL_SD1PID_Msk(EP)        ((EP) > 0 ? ((uint32_t)1 << USBOTG_HS_DOEPCTL_SD1PID_Pos(EP)) : 0)
# define USBOTG_HS_DOEPCTL_SODDFRM_Pos(EP)        29
# define USBOTG_HS_DOEPCTL_SODDFRM_Msk(EP)        ((EP) > 0 ? ((uint32_t)1 << USBOTG_HS_DOEPCTL_SODDFRM_Pos(EP)) : 0)
#endif
# define USBOTG_HS_DOEPCTL_EPDIS_Pos        30
# define USBOTG_HS_DOEPCTL_EPDIS_Msk        ((uint32_t)1 << USBOTG_HS_DOEPCTL_EPDIS_Pos)
# define USBOTG_HS_DOEPCTL_EPENA_Pos        31
# define USBOTG_HS_DOEPCTL_EPENA_Msk        ((uint32_t)1 << USBOTG_HS_DOEPCTL_EPENA_Pos)

/* Device endpoint interrupt register */
# define USBOTG_HS_DOEPINT_XFRC_Pos        0
# define USBOTG_HS_DOEPINT_XFRC_Msk        ((uint32_t)1 << USBOTG_HS_DOEPINT_XFRC_Pos)
# define USBOTG_HS_DOEPINT_EPDISD_Pos        1
# define USBOTG_HS_DOEPINT_EPDISD_Msk        ((uint32_t)1 << USBOTG_HS_DOEPINT_EPDISD_Pos)
# define USBOTG_HS_DOEPINT_STUP_Pos        3
# define USBOTG_HS_DOEPINT_STUP_Msk        ((uint32_t)1 << USBOTG_HS_DOEPINT_STUP_Pos)
# define USBOTG_HS_DOEPINT_OTEPDIS_Pos        4
# define USBOTG_HS_DOEPINT_OTEPDIS_Msk        ((uint32_t)1 << USBOTG_HS_DOEPINT_OTEPDIS_Pos)
# define USBOTG_HS_DOEPINT_B2BSTUP_Pos        6
# define USBOTG_HS_DOEPINT_B2BSTUP_Msk        ((uint32_t)1 << USBOTG_HS_DOEPINT_B2BSTUP_Pos)
# define USBOTG_HS_DOEPINT_NYET_Pos        14
# define USBOTG_HS_DOEPINT_NYET_Msk        ((uint32_t)1 << USBOTG_HS_DOEPINT_NYET_Pos)

